ackroo-weather/app/views/weathers/latest.html.erb

SELECT "weathers".* FROM "weathers" ORDER BY "weathers"."id" DESC LIMIT $1  [["LIMIT", 1]]
---

    <% if @data[:weather].present? %>