ackroo-weather/app/controllers/weathers_controller.rb

SELECT "weathers".* FROM "weathers" ORDER BY "weathers"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def latest
    weather = Weather.last