ackroo-weather/app/controllers/weathers_controller.rb

SELECT "weathers".* FROM "weathers" ORDER BY "weathers"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def latest
    weather = Weather.last
    # raise StandardError, 'Some error happened! Try later.'
    unless weather.nil? || weather.time.to_i < 1.hour.ago.to_i
      ws = WeatherService.new
      weather = ws.fetch_data
    end

    @data = { weather: weather }

  rescue StandardError => e
    flash['alert'] = e.message
    weather = Weather.last