ackroo-weather/app/services/weather_service.rb

  def fetch_data
    # Test purpose
    Weather.create(
      time: Time.now.utc,
      air_temp: '44.21',
      pressure: '54.32',
      humidity: '67.87',
      precipitation: '22.34',
      wind_speed: '45.00'
    )
---
INSERT INTO "weathers" ("time", "air_temp", "pressure", "humidity", "precipitation", "wind_speed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"